sascha8a/cits-to-go/wifi-uplink-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_TARGET_ESP32C5=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_CITS_UPLINK_SPI_CS_GPIO=0
CONFIG_CITS_UPLINK_SPI_READY_GPIO=25
CONFIG_CITS_UPLINK_SPI_MOSI_GPIO=7
CONFIG_CITS_UPLINK_SPI_MISO_GPIO=23
CONFIG_CITS_UPLINK_SPI_CLK_GPIO=24
CONFIG_CITS_UPLINK_LED_GPIO=27
CONFIG_CITS_UPLINK_LED_ACTIVE_LOW=y
CONFIG_CITS_UPLINK_HEALTH_CHECK_INTERVAL_MS=5000
CONFIG_CITS_UPLINK_WIFI_RECOVERY_INTERVAL_MS=15000
CONFIG_CITS_UPLINK_WIFI_RESTART_AFTER_MS=300000
CONFIG_CITS_UPLINK_MQTT_RECOVERY_MS=120000
CONFIG_CITS_UPLINK_TASK_STALL_RESTART_MS=60000
